Model: "model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, 32, 32, 3)]  0                                            
__________________________________________________________________________________________________
conv2d (Conv2D)                 (None, 32, 32, 16)   448         input_1[0][0]                    
__________________________________________________________________________________________________
batch_normalization (BatchNorma (None, 32, 32, 16)   64          conv2d[0][0]                     
__________________________________________________________________________________________________
activation (Activation)         (None, 32, 32, 16)   0           batch_normalization[0][0]        
__________________________________________________________________________________________________
conv2d_1 (Conv2D)               (None, 32, 32, 16)   2320        activation[0][0]                 
__________________________________________________________________________________________________
batch_normalization_1 (BatchNor (None, 32, 32, 16)   64          conv2d_1[0][0]                   
__________________________________________________________________________________________________
activation_1 (Activation)       (None, 32, 32, 16)   0           batch_normalization_1[0][0]      
__________________________________________________________________________________________________
conv2d_2 (Conv2D)               (None, 32, 32, 16)   2320        activation_1[0][0]               
__________________________________________________________________________________________________
conv2d_3 (Conv2D)               (None, 32, 32, 16)   272         activation[0][0]                 
__________________________________________________________________________________________________
add (Add)                       (None, 32, 32, 16)   0           conv2d_2[0][0]                   
                                                                 conv2d_3[0][0]                   
__________________________________________________________________________________________________
batch_normalization_2 (BatchNor (None, 32, 32, 16)   64          add[0][0]                        
__________________________________________________________________________________________________
activation_2 (Activation)       (None, 32, 32, 16)   0           batch_normalization_2[0][0]      
__________________________________________________________________________________________________
conv2d_4 (Conv2D)               (None, 32, 32, 16)   2320        activation_2[0][0]               
__________________________________________________________________________________________________
batch_normalization_3 (BatchNor (None, 32, 32, 16)   64          conv2d_4[0][0]                   
__________________________________________________________________________________________________
activation_3 (Activation)       (None, 32, 32, 16)   0           batch_normalization_3[0][0]      
__________________________________________________________________________________________________
conv2d_5 (Conv2D)               (None, 32, 32, 16)   2320        activation_3[0][0]               
__________________________________________________________________________________________________
add_1 (Add)                     (None, 32, 32, 16)   0           add[0][0]                        
                                                                 conv2d_5[0][0]                   
__________________________________________________________________________________________________
batch_normalization_4 (BatchNor (None, 32, 32, 16)   64          add_1[0][0]                      
__________________________________________________________________________________________________
act1 (Activation)               (None, 32, 32, 16)   0           batch_normalization_4[0][0]      
__________________________________________________________________________________________________
conv2d_6 (Conv2D)               (None, 16, 16, 32)   4640        act1[0][0]                       
__________________________________________________________________________________________________
batch_normalization_5 (BatchNor (None, 16, 16, 32)   128         conv2d_6[0][0]                   
__________________________________________________________________________________________________
activation_4 (Activation)       (None, 16, 16, 32)   0           batch_normalization_5[0][0]      
__________________________________________________________________________________________________
conv2d_7 (Conv2D)               (None, 16, 16, 32)   9248        activation_4[0][0]               
__________________________________________________________________________________________________
conv2d_8 (Conv2D)               (None, 16, 16, 32)   544         act1[0][0]                       
__________________________________________________________________________________________________
add_2 (Add)                     (None, 16, 16, 32)   0           conv2d_7[0][0]                   
                                                                 conv2d_8[0][0]                   
__________________________________________________________________________________________________
batch_normalization_6 (BatchNor (None, 16, 16, 32)   128         add_2[0][0]                      
__________________________________________________________________________________________________
activation_5 (Activation)       (None, 16, 16, 32)   0           batch_normalization_6[0][0]      
__________________________________________________________________________________________________
conv2d_9 (Conv2D)               (None, 16, 16, 32)   9248        activation_5[0][0]               
__________________________________________________________________________________________________
batch_normalization_7 (BatchNor (None, 16, 16, 32)   128         conv2d_9[0][0]                   
__________________________________________________________________________________________________
activation_6 (Activation)       (None, 16, 16, 32)   0           batch_normalization_7[0][0]      
__________________________________________________________________________________________________
conv2d_10 (Conv2D)              (None, 16, 16, 32)   9248        activation_6[0][0]               
__________________________________________________________________________________________________
add_3 (Add)                     (None, 16, 16, 32)   0           add_2[0][0]                      
                                                                 conv2d_10[0][0]                  
__________________________________________________________________________________________________
batch_normalization_8 (BatchNor (None, 16, 16, 32)   128         add_3[0][0]                      
__________________________________________________________________________________________________
act2 (Activation)               (None, 16, 16, 32)   0           batch_normalization_8[0][0]      
__________________________________________________________________________________________________
conv2d_11 (Conv2D)              (None, 8, 8, 64)     18496       act2[0][0]                       
__________________________________________________________________________________________________
batch_normalization_9 (BatchNor (None, 8, 8, 64)     256         conv2d_11[0][0]                  
__________________________________________________________________________________________________
activation_7 (Activation)       (None, 8, 8, 64)     0           batch_normalization_9[0][0]      
__________________________________________________________________________________________________
conv2d_12 (Conv2D)              (None, 8, 8, 64)     36928       activation_7[0][0]               
__________________________________________________________________________________________________
conv2d_13 (Conv2D)              (None, 8, 8, 64)     2112        act2[0][0]                       
__________________________________________________________________________________________________
add_4 (Add)                     (None, 8, 8, 64)     0           conv2d_12[0][0]                  
                                                                 conv2d_13[0][0]                  
__________________________________________________________________________________________________
batch_normalization_10 (BatchNo (None, 8, 8, 64)     256         add_4[0][0]                      
__________________________________________________________________________________________________
activation_8 (Activation)       (None, 8, 8, 64)     0           batch_normalization_10[0][0]     
__________________________________________________________________________________________________
conv2d_14 (Conv2D)              (None, 8, 8, 64)     36928       activation_8[0][0]               
__________________________________________________________________________________________________
batch_normalization_11 (BatchNo (None, 8, 8, 64)     256         conv2d_14[0][0]                  
__________________________________________________________________________________________________
activation_9 (Activation)       (None, 8, 8, 64)     0           batch_normalization_11[0][0]     
__________________________________________________________________________________________________
conv2d_15 (Conv2D)              (None, 8, 8, 64)     36928       activation_9[0][0]               
__________________________________________________________________________________________________
add_5 (Add)                     (None, 8, 8, 64)     0           add_4[0][0]                      
                                                                 conv2d_15[0][0]                  
__________________________________________________________________________________________________
batch_normalization_12 (BatchNo (None, 8, 8, 64)     256         add_5[0][0]                      
__________________________________________________________________________________________________
act3 (Activation)               (None, 8, 8, 64)     0           batch_normalization_12[0][0]     
__________________________________________________________________________________________________
average_pooling2d (AveragePooli (None, 1, 1, 64)     0           act3[0][0]                       
__________________________________________________________________________________________________
flatten (Flatten)               (None, 64)           0           average_pooling2d[0][0]          
__________________________________________________________________________________________________
final_output (Dense)            (None, 10)           650         flatten[0][0]                    
==================================================================================================
Total params: 176,826
Trainable params: 175,898
Non-trainable params: 928
__________________________________________________________________________________________________
